# Soal No.2

Using Dataset B above, Write a query to get the rolling sum total of sales using the window function!

In [1]:
import pandas as pd
import numpy as np
import datetime
import sqlite3

In [2]:
conn = sqlite3.connect('python2.db')

In [3]:
cur = conn.cursor()

# Create table
cur.execute(
    """CREATE TABLE IF NOT EXISTS database_b
    (date timestamp,
    sales int)""")

# Insert a row of data
cur.execute("INSERT INTO database_b VALUES ('01/01/21', 100)")
cur.execute("INSERT INTO database_b VALUES ('02/01/21', 34)")
cur.execute("INSERT INTO database_b VALUES ('02/01/21', 123)")
cur.execute("INSERT INTO database_b VALUES ('02/01/21', 134)")
cur.execute("INSERT INTO database_b VALUES ('03/01/21', 145)")
cur.execute("INSERT INTO database_b VALUES ('03/01/21', 24)")
cur.execute("INSERT INTO database_b VALUES ('04/01/21', 541)")
cur.execute("INSERT INTO database_b VALUES ('04/01/21', 636)")
cur.execute("INSERT INTO database_b VALUES ('05/01/21', 322)")
cur.execute("INSERT INTO database_b VALUES ('06/01/21', 242)")
cur.execute("INSERT INTO database_b VALUES ('07/01/21', 22)")
cur.execute("INSERT INTO database_b VALUES ('08/01/21', 46)")

# Save (commit) the changes
conn.commit()

In [4]:
query= '''SELECT * FROM database_b '''

In [5]:
df = pd.read_sql_query(query, conn)

In [6]:
df

        date  sales
0   01/01/21    100
1   02/01/21     34
2   02/01/21    123
3   02/01/21    134
4   03/01/21    145
5   03/01/21     24
6   04/01/21    541
7   04/01/21    636
8   05/01/21    322
9   06/01/21    242
10  07/01/21     22
11  08/01/21     46

In [7]:
query2 = '''SELECT date, SUM(sales) AS total_of_sales FROM database_b GROUP BY date'''

In [8]:
df = pd.read_sql_query(query2, conn)

In [9]:
df

       date  total_of_sales
0  01/01/21             100
1  02/01/21             291
2  03/01/21             169
3  04/01/21            1177
4  05/01/21             322
5  06/01/21             242
6  07/01/21              22
7  08/01/21              46